'use strict';

setTimeout(function (_) {
  var t = $('#t').text();
  $('#tt').text(`Повторная экспертиза показала наличие алкоголя в крови мальчика, погибшего в ДТП в Балашихе321Поклонская: посмотревших «Матильду» прихожан отлучили от причастия242Во вторник к врачам обратилось рекордное число паломников из очереди к мощам Николая Чудотворца189Страховка от фальши184Самые популярные фильмы на ТВ в 2016 году153Минфин придумал новый способ заставить людей копить на пенсии120"Газпром" заявил, что новые санкции США угрожают поставкам газа в Европу88Главой Нижнего Новгорода выбрана Елизавета Солонченко76Росавиация опубликовала первый список задержек чартерных рейсов68Фигурантка дела «Оборонсервиса» Евгения Васильева стала секретарем ТСЖ дома в Москве63АвтоВАЗ назвал цены на эксклюзивную версию Lada Xray57Параллельная «Прямая»54Граждане, сдавайте биткойны!52Польша приостановила реверс российского газа из Германии51В холодном лете Москвы обвинили «североатлантический блок»50Родители Жанны Фриске обжаловали решение суда о взыскании с них 21 млн рублей в пользу Русфонда43Бывший директор «Гоголь-центра» арестован на два месяца40ФСО разрешили скрывать данные высших чиновников38В китайских БАДАх обнаружены опасные для здоровья мужчин вещества36Польша приостановила реверс российского газа из Германии32Руководство «Яблока» приостановило полномочия руководящих органов свердловского отделения партии30Опубликовано видео сближения истребителя F-16 с самолетом Шойгу29Кремль: показанные Оливеру Стоуну кадры операции в Сирии представило Минобороны27«Яблоко» выдвинуло Евгения Ройзмана кандидатом в свердловские губернаторы23Премия ТЭФИ перенесена на октябрь20В Госдуму внесен законопроект о tax free18Об особом пути и секретном ингредиенте`);
  $('#s').text(`Песков: Путин показал Оливеру Стоуну видеозапись операции в Сирии с чужого смартфона16Американский Pew Research Center оценил отношение россиян к Владимиру Путину14Мобильный интернет-трафик в России растет все быстрее13Российские информагентства сообщили об инциденте с участием самолета Шойгу и истребителя НАТО11С надеждой на лучшее12Subaru отзывает в России 24,4 тысячи автомобилей12В Госдуму внесен законопроект, отменяющий страховые медицинские организации10Реновации готовят референдумы11Умер разведчик КГБ СССР Юрий Дроздов9ВЭБ: разнообразие проектов «оборонки» оставляет желать лучшего9Правительство внесло в Госдуму законопроект о tax free9«Москва»: фигурант дела «Оборонсервиса» Евгения Васильева стала секретарем ТСЖ9В холодном лете Москвы обвинили «североатлантический блок»8Курс доллара превысил 60 руб./$ впервые с февраля8Здоровье Амана Тулеева не вызывает опасений у администрации Кузбасса8«Худшего удалось избежать»7«Такова воля короля»7Икона и стиль`);
  $('#f').text(`соцсети
Россия
регионы

7Курс доллара превысил 60 руб./$ впервые с февраля6К самолету министра обороны Шойгу пытался приблизиться истребитель НАТО6Алиса Мельникова переходит в ЦБ5Герцог Эдинбургский госпитализирован5Желаемое против действительного5Рубль сдался5Приватизацию «Совкомфлота» могут перенести на неопределенный срок4Царь – не настоящий?4Путин попросил Сечина вернуться к вопросу о выплате дивидендов в 50% от прибыли4Boeing: к авиакатастрофам приводят несколько ошибок пилотов подряд4Госкомстрой Башкирии начал поиск инвестора для завершения строительства «Миловского парка»3В Кремле пообещали ответить взаимностью на расширение санкций США3Преступление и показатели: зачем таможенникам наркотики?3Казахстан снова затевает реформы3Сбербанк запустил новый инструмент сервиса E-invoicing: «Нулевую отчетность»3Оценка топ-менеджеров: как без тотального контроля понять, справляется ли топ-менеджер
V2
3Революция в образовании будет мирной3Стабильный берег3Дачникам разрешат строить любые дома, а дорогами, электричеством и водой займутся муниципалитеты3Курс рубля продолжает снижаться на фоне дешевеющей нефти2Нет денег — есть стратегия2Губернатору Кузбаса Аману Тулееву провели операцию на позвоночнике2Главой Нижнего Новгорода избрана Елизавета Солонченко2Обвиняемые в убийстве Немцова попросили присяжных оправдать их2Глава Нефтегорского района Самарской области подозревается в получении взятки2Бывшему генеральному продюсеру «Седьмой студии» предъявлено обвинение в мошенничестве2Награждение лауреатов премии ТЭФИ-2017 перенесено на октябрь из-за сбоя при голосовании жюри2Неформальные дороги и кладбища2Шойгу: военная ситуация у западных границ ухудшается2"РГ": страховщиков отлучат от системы ОМС2Умер инициатор создания разведотряда «Вымпел»2Епархия продолжит строительство часовни в сквере возле ЮУрГУ2Honda на сутки остановила один из заводов из-за кибератаки2Международный день йоги2Многодетным семьям предлагают давать беспроцентные жилищные кредиты2Снять и забить2Чиновники объяснили, когда «Роснефть» поднимет дивиденды до 50%2Первые отрезки на ЦКАД начнут запускать с 26 июня2Омбудсмен Москалькова предупредила, что валютные ипотечники идут на крайние меры2ВВП РФ в мае подскочил на 3,1% при общем росте в 1,3% за первые пять месяцев года2От IPO к ICO2Госдума потратит 29 млн рублей на выяснение мнения россиян о своей работе2Импульс на ослабление рубля получает продолжение2Средства резервного фонда направят на помощь ипотечным заемщикам2"Яблоко" выдвинуло Ройзмана кандидатом в губернаторы Свердловской области1Памятник 7 процентам1Глава Uber сдался под давлением инвесторов и скандалов1Боб Ллойд, генеральный директор компании Hyperloop One1Газета Коммерсантъ № 66(6060) от 17.04.20171Природоохранная прокуратура предложила властям Челябинска пути решения проблем с экологией`);
}, 40);

var rand = function(s){
  return Math.random() > (s||.5)
}
var tout = undefined;
var getname = function(){
  var names = ['aa', 'fun', 'happy', 'panic', 'sad'];
  var name = names[Math.floor(Math.random()* names.length)];
  return `/img/${name}.gif`
}
setInterval(function(){
  if(rand()){
    if(tout){
      clearTimeout(tout)
    }
    $('#b').addClass('blick')
    $('#t').attr('src', getname())
  }else{
    tout = setTimeout(()=> $('#b').removeClass('blick') , 600)
  }
}, 500)
